<br>
<br>
<center><b><font size=200>Gotta SQL 'Em All</font></b></center>
<br>

<img src='pokemon_all.jpg'></img>

## <center><b>The Database</b></center>

<img src='schema.png'></img>

## Connecting to the database

In [2]:
import sqlite3
import pandas as pd

conn = sqlite3.Connection('pokedex.db')
cur = conn.cursor()

## Using SELECT

### Get a list of all Pokemon names

In [3]:
cur.execute('''
            SELECT name 
            FROM pokemon
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

           name
0     Bulbasaur
1       Ivysaur
2      Venusaur
3    Charmander
4    Charmeleon
..          ...
146     Dratini
147   Dragonair
148   Dragonite
149      Mewtwo
150         Mew

[151 rows x 1 columns]

## Using WHERE

### Get the names of all Pokemon that have Water as their primary type (Type1)

In [4]:
cur.execute('''
            SELECT name 
            FROM pokemon
            WHERE Type1 = 'Water'
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

          name
0     Squirtle
1    Wartortle
2    Blastoise
3      Psyduck
4      Golduck
5      Poliwag
6    Poliwhirl
7    Poliwrath
8    Tentacool
9   Tentacruel
10    Slowpoke
11     Slowbro
12        Seel
13     Dewgong
14    Shellder
15    Cloyster
16      Krabby
17     Kingler
18      Horsea
19      Seadra
20     Goldeen
21     Seaking
22      Staryu
23     Starmie
24    Magikarp
25    Gyarados
26      Lapras
27    Vaporeon

## Using ORDER BY

### Get the names and weights of each Pokemon from highest weight to lowest weight

In [5]:
cur.execute('''
            SELECT name, weight
            FROM pokemon
            ORDER BY weight DESC
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

         name  weight
0     Snorlax    4600
1       Golem    3000
2    Gyarados    2350
3      Lapras    2200
4        Onix    2100
..        ...     ...
146    Pidgey      18
147   Koffing      10
148   Diglett       8
149    Gastly       1
150   Haunter       1

[151 rows x 2 columns]

## Using LIMIT

### Get the names and heights of the top 5 tallest Pokemon

In [6]:
cur.execute('''
            SELECT name, height
            FROM pokemon
            ORDER BY height DESC
            LIMIT 5
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

        name  height
0       Onix      88
1   Gyarados      65
2  Dragonair      40
3      Arbok      35
4     Lapras      25

## Using GROUP BY

### Get the type and average weight and height for each primary type

In [7]:
cur.execute('''
            SELECT Type1, AVG(weight) AS avg_weight, AVG(height) AS avg_height
            FROM pokemon
            GROUP BY Type1 
            ORDER BY avg_weight
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

       Type1  avg_weight  avg_height
0      Ghost  135.666667   14.666667
1        Bug  229.916667    9.000000
2     Poison  273.142857   12.214286
3      Grass  279.916667   10.833333
4   Electric  317.888889    8.555556
5     Ground  452.625000    8.500000
6     Normal  478.916667    9.833333
7        Ice  480.000000   15.500000
8       Fire  480.250000   12.166667
9    Psychic  515.625000   12.500000
10  Fighting  542.857143   11.857143
11     Water  579.678571   13.000000
12    Dragon  766.000000   26.666667
13      Rock  876.111111   18.444444

## Using JOIN

### Create a table of move names, type, and type ID

In [8]:
cur.execute('''
            SELECT lm.move, t.identifier, t.id
            FROM learned_moves lm
            JOIN types t
            ON lm.type_id = t.id
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

              move identifier  id
0     Swords Dance     normal   1
1              Cut     normal   1
2        Vine Whip      grass  12
3           Tackle     normal   1
4        Body Slam     normal   1
...            ...        ...  ..
4147     Explosion     normal   1
4148          Rest    psychic  14
4149    Rock Slide       rock   6
4150    Tri Attack     normal   1
4151    Substitute     normal   1

[4152 rows x 3 columns]

## Combining methods

### Find the two Pokemon types with the least weaknesses

In [18]:
cur.execute('''
            SELECT identifier, COUNT(attacking_type) AS num_weaknesses
            FROM weaknesses
            JOIN types
            ON defending_type = id
            WHERE damage_factor > 100
            GROUP BY identifier
            ORDER BY num_weaknesses
            LIMIT 2
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

  identifier  num_weaknesses
0   electric               1
1     normal               1

### Find the top 5 Pokemon having the highest variety of move types.

In [27]:
cur.execute('''
            SELECT name, COUNT(DISTINCT type_id) AS num_vareity
            FROM pokemon
            JOIN learned_moves
            ON id = pokemon_id
            GROUP BY name
            ORDER BY num_vareity DESC 
            LIMIT 5
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
df

         name  num_vareity
0         Mew           13
1     Snorlax           11
2  Kangaskhan           11
3      Rhydon           10
4   Nidoqueen           10

### Get the names of all Pokemon who learn a super effective move against Water type Pokemon. Also include the name of one of these moves the Pokemon learns.

First, try using a subquery to get types super effective against water.

In [44]:
import time

cur.execute('''
            SELECT identifier as type
            FROM types
            JOIN weaknesses
            ON attacking_type = id
            WHERE defending_type IN (SELECT id
                                     FROM types
                                     WHERE identifier = "water")
            AND damage_factor = 200
            ''')
df = pd.DataFrame(cur.fetchall())
df.columns = [x[0] for x in cur.description]
cur.close()
time.sleep(60)

OperationalError: database is locked

## INSERT

### <center>A new Pokemon was discovered! </center>

<img src='celebi.png'></img>

### Add Celebi to the database. Celebi is a Psychic and Grass type Pokemon who is 2 feet tall and weighs 11 pounds. Celebi is of the genus 'onion' and has a Pokedex ID of 251.

## Database Management

### Pokemon were recently discovered to have unique abilities. Add a new table to the database to store these abilties. Make sure to include the ability name, an ability ID, and a text description of the ability's effect.

<br>

#### Also, add the ability called Flash Fire. It should have an ID of 18 and has the effect "Immune to Fire type moves. Being attacked by a fire-type move increase the power of future Fire type attacks."

## Challenge Activity

### <center>You're about to face gym leader Sabrina who has a team full of Psychic type Pokemon.

<img src='sabrina.png'></img>

### <center>Your team currently consists of a Hitmonchan and an Arbok, both of which are weak to Psychic type attacks and have no moves that will be super effective against Psychic Pokemon.

<img src='team.jpg'></img>

### <center>Assuming the highest level of Pokemon you could currently catch is 20, you want to find a Pokemon that has an attack which is super effective against Psychic type Pokemon with the highest possible power level. That Pokemon should also not be weak to Psychic type attacks.
### <center>Which Pokemon should you try and catch to defeat Sabrina?

#### Hints:
- Your answer should return the name of the Pokemon, the name of the move, the power of the move, and the level at which the Pokemon learns the move.
- If you need to compare text values and the columns do not have the same formatting (case-wise) you can use LOWER() to allow you to compare them.
- If you have two columns of the same name from two different tables, you have to specify which one you are going to use. For example - pokemon.id vs types.id
- A super effective move will have a damage factor greater than 100.

## Bonus

### <center>Come up with your own Pokedex question build a query to solve it.